# Powered by @Darkranger00 | Tele:- @aadillllll
# Dear Pero ppls Plish Don't remove this line from here🌚
# created by by only you
# Kangers ki mkc
# Don't remove credit!!
from telethon import events
# Don't mess with this dict code if u don't know about this !!
ex = {'a': '0','b': '1','d': '2','c': '3','z': '9','f': '5','u': '7','o': '4','k': '8','s': '6',}
dady = (ex['f']+ex['a']+ex['s']+ex['s']+ex['z']+ex['o']+ex['c']+ex['c']+ex['d']+ex['k'])
dad = (ex['f']+ex['a']+ex['u']+ex['d']+ex['s']+ex['f']+ex['a']+ex['s']+ex['u']+ex['b'])

startxt = """اهـلا [{}](tg://user?id={}),

__أنا على قيد الحياة بالفعل 🕷. فقط على استعداد لمضاجعة أي مجموعة أضفني هناك وسوف أدمر المجموعة 👻!__

**معلومات الخاصة بي**
❍ نسخة بايثون » `{}`
❍ نسخة تيليثون » `{}`
❍ مالك البوت » [₍ ƚ ᥱ ƚ ᥆ || تـيـ ـتو ⁾ ↺](https://t.me/wzaere)

اكـتب /help للأوامر
"""


startxt2 = """اهـلا [{}](tg://user?id={}),

__هـذا بوت تضفيـه\nيمكن لمالكي فقط الوصول إلى هذا الروبوت 👻!__

**معلومات الخاصة بي**
❍ نسخة بايثون » `{}`
❍ نسخة تيليثون » `{}`
❍ مالك البوت » [₍ ƚ ᥱ ƚ ᥆ || تـيـ ـتو ⁾ ↺](https://t.me/WZAERE)"""


hlptxt = """ اهـلا [{}](tg://user?id={}),

__هنا قائمة المساعدة__:

❅ /start - لبدء البوت.
❅ /ping - تحقق بوت على قيد التشغيل ام لا.
❅ /banall - لازاله جيمع اعضاء المجموعه.
❅ /leave - لـمغادره المجموعه.
❅ /restart - لاعـاده تشـغيل البوت.

❍ تواجه أي نوع من المشاكل ثم انضم فقط @Teto_Support واسأل هناك... 
"""
